//verilog 的核心是module,module定义了一个元器件的行为,如加减法,时序,存储等,
//每个module是一个独立的设计单元,可以被其他module调用,也可以调用其他module,
//每个module都有自己的端口列表,端口列表中包含输入端口和输出端口,端口列表中的信号可以是wire类型也可以是reg类型,
//端口列表中的信号可以是单比特也可以是多比特,端口列表中的信号可以是有符号也可以是无符号;
//module的定义格式如下:

module 模块名([端口列表]);
[端口模块声明;]
[参数声明;]

内部信号声明                                 //assign语句
底层模块或门原句调用 (包括生成块)              //initial或always
任务和函数定义                               //specify块

//三种语句顺序无关,只有module和endmodule是必需的
endmodule




/*******************    例   1    *****************/

//二选一数据选择器的描述

module  MUX21a  (a,b,s,y);            //模块名 (端口列表)
    input a,b,s;                      //端口信号和参数声明
    output y;
    assign y = (s ? a : b);           //assign 语句,指定赋值    ***  a?b:c 如果a为真,则输出b,否则输出c
endmodule

          ________
-----s---|  MUX   |
-----a---|        |--y---
-----b---|________|     //二选一的数据选择器s为0,时选b,为1时选a,当然,也有的数据选择器外形和sab顺序有所区别,但是基本功能是一样的


/*******************    例   2    *****************/

//边沿D触发器的描述:

module DFF (clk,d,q);                 //模块名 (端口列表)
    input clk,d;                      //端口信号和参数声明
    output reg q;                     //q是寄存器类型
    always @(posedge clk)             //always块,在clk上升沿触发
        q <= d;                      //非阻塞赋值语句,当clk上升沿时,将d的值赋给q
endmodule

           _______
----d-----|       |-----Q---
----clk---|D触发器|
          |_______|-----Q'--        //clk上升沿时,将d的值赋给q,同时q'为q的反向输出



/*******************    例   3    *****************/

//full_adder的描述:

module full_adder (a,b,cin,sum,cout);   //模块名 (端口列表)
    input [3:0]a,b;
    input cin;                  //端口信号和参数声明
    output reg [3:0]sum;
    output cout;
    assign sum = a ^ b ^ cin;        //assign 语句,指定赋值
    assign cout = (a & b) | (b & cin) | (a & cin);
endmodule


          _________
----a--- |         |
----b--- |  全加器  |----sum---
--cin--- |_________|----cout--    
//全加器,输入a,b,cin,输出sum,cout,当a,b,cin中有两个或两个以上为1时,cout为1,否则为0;sum为a,b,cin的异或值



位宽不做说明默认是一位 , 数据类型不做说明默认是wire型;
wire是线, reg是寄存器, reg类型的信号在always块中赋值, wire类型的信号在assign语句中赋值;
[3:0]代表位宽是4位, 3是最高位, 0是最低位;
例如sum[3],sum[2],sum[1],sum[0]分别代表4位的每一位;




assign语句是连续赋值语句,在assign语句中,左边的信号必须是wire类型,右边的信号可以是wire类型也可以是reg类型;


assign表达式中的值只要有变化就会立刻进行计算和赋值
([这也很好理解,毕竟assign语句中的都是wire线类型,线上的值是会随即响应的])



例                             
                                  ________
                                 |        |
                             A---|  AND   |----Y
                                 |________|
                                     |
                                     M
                                  ___|____
assign M = B|C;                  |        |
assign Y = A & M;                |   OR   |
                                 |________|
                                 |        | 
                                 B        C
                  
assign 语句中有运算符,包括算术,逻辑,关系,以及位运算符,等价运算符,缩减运算符,
这些运算符的优先级和C语言是一样的,可以使用括号来改变运算顺序;
--算术/逻辑:和c语言一样:  加+,减-,乘*,除/,取余%,求幂**   非!,与&&,或||,异或^,

--关系运算符   >,<,>=,<=,==,!=,

--位运算符     &,|,^,~,<<,>>,<<<,>>>

--等价运算符   等于==,不等于!=,case不等于!==,case等于===  等于==,不等于!=的结果为0,1,x,case不等于!==,case等于===的结果只有0和1;

--缩减运算符   &按位与,|按位或,^按位异或,~&按位与非,~|按位或非,~^按位异或非,这些运算符的结果是1位的;
例如: Y=& 4' b1001;      //Y=0,因为4' b1001将各位从左向右按位与的结果是0,0,0,0,所以结果是0;

--拼接复制运算符  拼接{}  复制拼接{{}}  
{4' b1001,4' b0011}  //结果是8' b10010011; {{2{4' b1001}}}  //结果是8' b10011001;
{4{2' b10}}  //结果是8' b10101010;


always块是过程赋值语句,在always块中,左边的信号(赋值目标)必须是reg类型,右边的信号可以是wire类型也可以是reg类型;
always语句中还可以使用if,case,for循环等语句

基本格式:
always @(敏感信号列表) begin  
    赋值语句;
    赋值语句;
    ...
end
例:
always @(posedge clk) begin
    q <= d;                 //非阻塞赋值语句,当clk上升沿时,将d的值赋给q
end

//敏感条件满足时,过程块激活,敏感条件分边沿敏感和电平敏感两种:
1.边沿敏感:
        (posedge clk)  //在clk上升沿触发
        (negedge clk)  //在clk下降沿触发
2.电平敏感:
        (a,b,c)          //在a,b,c中任意一个信号发生变化时触发
        (a or b or c)         //同上


/*******************    例   1    *****************/

D上升沿触发器
always @ (posedge clk)          //只有clk触发时,Q才会变化,否则,就算D改变,Q的值也不变
    Q <= D;                 

           _____
------D---| D Q |----Q---      //这个Q必须是reg型的
-----CLK--|_____|



/*******************    例   2    *****************/

always语句块示例

module DFF2 (RST,EN,D,Q,clk);          //模块名 (端口列表)
    input RST,EN,D,clk;                 //端口信号和参数声明
    output reg Q;                       //Q是寄存器类型
    always @ (posedge clk)
    begin
        if(!RST)
           Q <= 0;             //如果复位信号为低电平,则将Q置为0
        else if(EN)
           Q <= D;             //如果使能信号为高电平,则将D的值赋给Q
    end
endmodule
       ______
--D---| D  Q |--Q--
--EN--|      |
--CLK-|______|
        |
       RST

阻塞式赋值(串行):
always @ (A,B)                  //设A,B同时由0变1,激活前,M0=M1=Q=0
begin
   M1=A;                        //直接把A,(1)的值赋给M1
   M2=M1&B;                     //M2=1
   Q=M1|M2;                     //Q=1
end

非阻塞式赋值(并行):              //和阻塞式的区别在于,要在赋值语句右侧执行完毕后,才会传给左侧的变量,所有的赋值语句都是并行执行的
always @ (A,B)                  //设A,B同时由0变1,激活
begin
    M1<=A;                      //A的值不会立刻被赋值给M1,而是等到always块结束后才会被赋值
    M2<=M1&B;                   //M1&B=0,因为M1还没有被赋值,0&1==0
    Q<=M1|M2;                   //M1|M2=0,因为M1和M2都还没有被赋值
end


底层模块和门原语调用:
例:
底层模块描述:
module DFF (clk,D,Q)
    input clk,D;
    output reg Q;
    always @ (posedge clk)
        Q <= D;
endmodule
底层模块调用格式:
    底层模块名  实例名  (端口映射);

例:
                                              ______
----------------------------d----------------|DFF2  |---|--Q---
            ____      ______                 |      |   |
       |---|OR  |-d1-|DFF1  |--------Q1------|______|   |
----a--|---|____|    |      |                           |
---clk-|-------------|______|                           |
       |________________________________________________|        //这一整个模块我们暂且叫它example

module example (a,clk,d,Q);
    input a,clk,d;
    output Q;
    wire d1;                       //d1是wire类型的信号
    wire Q1;
    
    DFF DFF1 (.clk(clk),.D(d1),.Q(Q1));           //底层模块调用,实例名为DFF1,端口映射为(clk,d1,Q1)
    DFF DFF2 (.clk(Q1),.D(d),.Q(Q));

    or(d1,a,Q);
endmodule

verilog中有一些内置的门原语,包括and,or,nand,nor,xor,xnor,not,buf,
这些门原语可以直接调用,不需要自己定义模块;
例:
and (out, in1, in2);      //and门原语调用,输出out,输入in1和in2
or (out, in1, in2);       //or门原语调用,输出out,输入in1和in2
not (out, in);            //not门原语调用,输出out,输入in
buf (out, in);            //buf门原语调用,输出out,输入in

########################################################################################################

***verilog中的数据类型***
verilog中的数据类型分为两大类
    net类(线网类):wire,tri,wand,triand,tri0,tri1,trior,trireg,triand,tran,tranif0,tranif1
    variable类(变量类类):reg,integer,time,real,realtime
net不需要保存,在仿真时也无需分配内存,而variable则需要

#####################################################################################
verilog的三种赋值方法:

1.使用连续语句赋值:
assign D=A&B;
assign E=D|C;

2.使用过程语句赋值:
always @ (a,b,c,d)
    begin
        D=A&B;
        E=D|C;
    end

3.使用门语句赋值:
and (D,A,B);
or (E,D,C);

#####################################################################################

verilog中的数字表示格式:

1.无符号数:
<位宽>' <进制><数字>
例:2' b00  ------>  (00)2
   5' d8   ------>  (01000)2

2.无符号数:
<位宽>' <sb><数字>
例:8' sb10111011  ----->(-69)10
   8' b10111011   ----->(187)10

有符号数采用补码的方式,开头是1就表示这是个负数,
8' sb就代表后七位组成的数字减去2^(8-1)(也就是128)

3.逻辑值:
三种:1,0,x(不确定),z(高阻态)

########################################################################

verilog语言中也有if和case语句,行为和c语言基本相通

if(sel) Q=A;
else Q=B;           //数据选择器

module MUX41 (s1,s2,a,b,c,d,y)
    input s1,s2,a,b,c,d;
    output reg y;
always @ (a,b,c,d,s1,s0)
begin
    case ({s1,s0})
        2'b00: y=a;
        2'b01: y=b;
        2'b10: y=c;
        2'b11: y=d;          //当case()括号中的值为何时执行何种操作
        default : y=0;
    endcase
end
endmodule
                  ______
---s0----|       |      |
---s1----|-------|MUX41 |
                 |      |
d----------------|      |----y---
c----------------|      |
b----------------|      |
a----------------|______|

